## ileri toplulastirma islemleri - apply

In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame(
    {
        "degisken1": [10, 23, 33, 22, 11, 99],
        "degisken2": [100, 253, 333, 262, 111, 969],
    },
    columns=["degisken1", "degisken2"],
)
df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [2]:
df.apply(np.sum)

# dataframe'de bulunan sütunların toplamını aldı

degisken1     198
degisken2    2028
dtype: int64

In [3]:
df.apply(np.mean)

# dataframe'de bulunan sütunların ortalamasını aldı.

degisken1     33.0
degisken2    338.0
dtype: float64

In [4]:
df2 = pd.DataFrame(
    {
        "gruplar": ["A", "B", "C", "A", "B", "C"],
        "degisken1": [10, 23, 33, 22, 11, 99],
        "degisken2": [100, 253, 333, 262, 111, 969],
    },
    columns=["gruplar", "degisken1", "degisken2"],
)
df2

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [5]:
df2.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

In [6]:
df2.groupby("gruplar").apply(np.mean)

gruplar
A     98.5
B     99.5
C    358.5
dtype: float64